$(function(){
    course_info = [
        ['85', '创新、发明与知识产权实务', '汤蓉', '计算机181'],
        ['89', '创新创业教育基础', '鄢田云', '计算机181'],
        ['80', '大学英语2', '郑琳', '计算机181'],
        ['85', '高等数学2C', '杜先云', '计算机181'], 
        ['90', '大学物理B', '陈敏', '计算机181'],
        ['89', '形势与政策1', '陈敏', '计算机181'],
        ['88', '中国近现代史纲要', '丁小珊', '计算机181'],
        ['85', '创新中国', '邱长燕', '通信181'],
        ['82', '透过性别看世界', '张晓亮', '数学181']
    ];

    for(let i=0; i<course_info.length; i++){
        $('tbody').append('<tr>' + 
            '<td>' + course_info[i][0] +'</td>' +
            '<td>' + course_info[i][1] +'</td>' +
            '<td>' + course_info[i][2] +'</td>' +
            '<td>' + course_info[i][3] +'</td>' +
            + '<tr>'
        );
    }
})